# Створити список з 12 елементів

lst = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

# Добавити в середину списку новий елемент зі значенням 56 ( середина має обчислюватися автоматично )

l = len(lst)
middle = l // 2
lst.insert(middle, 56)
print(lst)

# Обновити 2й елемент до 25

lst[2]= 25
print(lst)

# Додати в кінець списку 88

lst.append
print(lst)

# Видалити перший елемент списку

del lst[0]
print(lst)

# Видалити остатній елемент списку і вивести в консоль його значення ( для будь якої довжини списка )

tmp = lst.pop()
print(lst)
print(tmp)

# Знайти довжину кола і його площу якщо у вас відомий радіус кола. с = 2 * pi * r, s = pi * r ^ 2. Радіус задаєте в коді r = <something>, r - це змінна.

r = 7
pi = 3.14
c = 2 * pi * r
print(c)
s = pi * r ** 2
print(s)
